## [ethanhassett](https://hassettio.app.spacelift.io/stack/ethanhassett/run/01J9HRMF8H6YRBPBE8SXJ5QK47) plan logs

<details>
<summary>Click here to expand</summary>

```
[01J9C189FNGT0S8ZE53S3QGFF6] Planning changes with 0 custom hooks...
data.hcp_vault_secrets_secret.google_credentials: Reading...
data.hcp_vault_secrets_secret.cloudflare_api_token: Reading...
data.hcp_vault_secrets_secret.google_credentials: Read complete after 0s [id=spacelift]
data.hcp_vault_secrets_secret.cloudflare_api_token: Read complete after 0s [id=spacelift]
data.cloudflare_zone.this: Reading...
google_service_account.cloud_run: Refreshing state... [id=projects/ethanhassett/serviceAccounts/cloudrun@ethanhassett.iam.gserviceaccount.com]
google_cloud_run_v2_service.this: Refreshing state... [id=projects/ethanhassett/locations/us-east1/services/ethanhassett]
google_project_iam_binding.service_account_user: Refreshing state... [id=ethanhassett/roles/iam.serviceAccountUser]
google_project_iam_binding.cloud_run_admin: Refreshing state... [id=ethanhassett/roles/run.admin]
data.cloudflare_zone.this: Read complete after 1s [id=f96446d78e054da3fe5c6ace7557f782]
cloudflare_record.www["1"]: Refreshing state... [id=3579ea6cd73550065e494b5d3f1e06e4]
cloudflare_record.www["4"]: Refreshing state... [id=ee5c6108d5b56dfd34f855a75ce94be5]
cloudflare_record.www["0"]: Refreshing state... [id=e577b05e1d29211d431f5ac83d63e970]
cloudflare_record.www["3"]: Refreshing state... [id=049ac7878b150072453e54fed5a3545b]
cloudflare_record.www["7"]: Refreshing state... [id=bcc07bda21a32c21f73acc351566eae3]
cloudflare_record.www["5"]: Refreshing state... [id=cc596c0579d9f7e57e3cfc3ddeb58dfb]
cloudflare_record.www["2"]: Refreshing state... [id=d80b662c7ae77cd390a4ff9e3f67b7a1]
cloudflare_record.www["6"]: Refreshing state... [id=b15204924496af96a46753a407c437c7]
google_cloud_run_domain_mapping.this: Refreshing state... [id=locations/us-east1/namespaces/ethanhassett/domainmappings/ethanhassett.com]
google_cloud_run_service_iam_binding.this: Refreshing state... [id=v1/projects/ethanhassett/locations/us-east1/services/ethanhassett/roles/run.invoker]
google_cloud_run_domain_mapping.www: Preparing import... [id=locations/us-east1/namespaces/ethanhassett/domainmappings/www.ethanhassett.com]
google_cloud_run_domain_mapping.www: Refreshing state... [id=locations/us-east1/namespaces/ethanhassett/domainmappings/www.ethanhassett.com]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement

OpenTofu planned the following actions, but then encountered a problem:

  # cloudflare_record.www will be created
  + resource "cloudflare_record" "www" {
      + allow_overwrite = false
      + content         = "ghs.googlehosted.com."
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "www"
      + proxiable       = (known after apply)
      + ttl             = 300
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = "f96446d78e054da3fe5c6ace7557f782"
    }

  # cloudflare_record.www["0"] will be destroyed
  # (because resource does not use for_each)
  - resource "cloudflare_record" "www" {
      - allow_overwrite = false -> null
      - content         = "216.239.32.21" -> null
      - created_on      = "2024-10-06T20:14:02.751219Z" -> null
      - hostname        = "www.ethanhassett.com" -> null
      - id              = "e577b05e1d29211d431f5ac83d63e970" -> null
      - metadata        = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> null
      - modified_on     = "2024-10-06T20:14:02.751219Z" -> null
      - name            = "www" -> null
      - proxiable       = true -> null
      - proxied         = false -> null
      - tags            = [] -> null
      - ttl             = 300 -> null
      - type            = "A" -> null
      - zone_id         = "f96446d78e054da3fe5c6ace7557f782" -> null
    }

  # cloudflare_record.www["1"] will be destroyed
  # (because resource does not use for_each)
  - resource "cloudflare_record" "www" {
      - allow_overwrite = false -> null
      - content         = "216.239.34.21" -> null
      - created_on      = "2024-10-06T20:14:00.981414Z" -> null
      - hostname        = "www.ethanhassett.com" -> null
      - id              = "3579ea6cd73550065e494b5d3f1e06e4" -> null
      - metadata        = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> null
      - modified_on     = "2024-10-06T20:14:00.981414Z" -> null
      - name            = "www" -> null
      - proxiable       = true -> null
      - proxied         = false -> null
      - tags            = [] -> null
      - ttl             = 300 -> null
      - type            = "A" -> null
      - zone_id         = "f96446d78e054da3fe5c6ace7557f782" -> null
    }

  # cloudflare_record.www["2"] will be destroyed
  # (because resource does not use for_each)
  - resource "cloudflare_record" "www" {
      - allow_overwrite = false -> null
      - content         = "216.239.36.21" -> null
      - created_on      = "2024-10-06T20:14:02.722652Z" -> null
      - hostname        = "www.ethanhassett.com" -> null
      - id              = "d80b662c7ae77cd390a4ff9e3f67b7a1" -> null
      - metadata        = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> null
      - modified_on     = "2024-10-06T20:14:02.722652Z" -> null
      - name            = "www" -> null
      - proxiable       = true -> null
      - proxied         = false -> null
      - tags            = [] -> null
      - ttl             = 300 -> null
      - type            = "A" -> null
      - zone_id         = "f96446d78e054da3fe5c6ace7557f782" -> null
    }

  # cloudflare_record.www["3"] will be destroyed
  # (because resource does not use for_each)
  - resource "cloudflare_record" "www" {
      - allow_overwrite = false -> null
      - content         = "216.239.38.21" -> null
      - created_on      = "2024-10-06T20:14:01.469419Z" -> null
      - hostname        = "www.ethanhassett.com" -> null
      - id              = "049ac7878b150072453e54fed5a3545b" -> null
      - metadata        = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> null
      - modified_on     = "2024-10-06T20:14:01.469419Z" -> null
      - name            = "www" -> null
      - proxiable       = true -> null
      - proxied         = false -> null
      - tags            = [] -> null
      - ttl             = 300 -> null
      - type            = "A" -> null
      - zone_id         = "f96446d78e054da3fe5c6ace7557f782" -> null
    }

  # cloudflare_record.www["4"] will be destroyed
  # (because resource does not use for_each)
  - resource "cloudflare_record" "www" {
      - allow_overwrite = false -> null
      - content         = "2001:4860:4802:32::15" -> null
      - created_on      = "2024-10-06T20:14:01.723691Z" -> null
      - hostname        = "www.ethanhassett.com" -> null
      - id              = "ee5c6108d5b56dfd34f855a75ce94be5" -> null
      - metadata        = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> null
      - modified_on     = "2024-10-06T20:14:01.723691Z" -> null
      - name            = "www" -> null
      - proxiable       = true -> null
      - proxied         = false -> null
      - tags            = [] -> null
      - ttl             = 300 -> null
      - type            = "AAAA" -> null
      - zone_id         = "f96446d78e054da3fe5c6ace7557f782" -> null
    }

  # cloudflare_record.www["5"] will be destroyed
  # (because resource does not use for_each)
  - resource "cloudflare_record" "www" {
      - allow_overwrite = false -> null
      - content         = "2001:4860:4802:34::15" -> null
      - created_on      = "2024-10-06T20:14:00.86909Z" -> null
      - hostname        = "www.ethanhassett.com" -> null
      - id              = "cc596c0579d9f7e57e3cfc3ddeb58dfb" -> null
      - metadata        = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> null
      - modified_on     = "2024-10-06T20:14:00.86909Z" -> null
      - name            = "www" -> null
      - proxiable       = true -> null
      - proxied         = false -> null
      - tags            = [] -> null
      - ttl             = 300 -> null
      - type            = "AAAA" -> null
      - zone_id         = "f96446d78e054da3fe5c6ace7557f782" -> null
    }

  # cloudflare_record.www["6"] will be destroyed
  # (because resource does not use for_each)
  - resource "cloudflare_record" "www" {
      - allow_overwrite = false -> null
      - content         = "2001:4860:4802:36::15" -> null
      - created_on      = "2024-10-06T20:14:01.259893Z" -> null
      - hostname        = "www.ethanhassett.com" -> null
      - id              = "b15204924496af96a46753a407c437c7" -> null
      - metadata        = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> null
      - modified_on     = "2024-10-06T20:14:01.259893Z" -> null
      - name            = "www" -> null
      - proxiable       = true -> null
      - proxied         = false -> null
      - tags            = [] -> null
      - ttl             = 300 -> null
      - type            = "AAAA" -> null
      - zone_id         = "f96446d78e054da3fe5c6ace7557f782" -> null
    }

  # cloudflare_record.www["7"] will be destroyed
  # (because resource does not use for_each)
  - resource "cloudflare_record" "www" {
      - allow_overwrite = false -> null
      - content         = "2001:4860:4802:38::15" -> null
      - created_on      = "2024-10-06T20:14:01.983691Z" -> null
      - hostname        = "www.ethanhassett.com" -> null
      - id              = "bcc07bda21a32c21f73acc351566eae3" -> null
      - metadata        = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> null
      - modified_on     = "2024-10-06T20:14:01.983691Z" -> null
      - name            = "www" -> null
      - proxiable       = true -> null
      - proxied         = false -> null
      - tags            = [] -> null
      - ttl             = 300 -> null
      - type            = "AAAA" -> null
      - zone_id         = "f96446d78e054da3fe5c6ace7557f782" -> null
    }

  # google_cloud_run_domain_mapping.this is tainted, so it must be replaced
-/+ resource "google_cloud_run_domain_mapping" "this" {
      ~ id       = "locations/us-east1/namespaces/ethanhassett/domainmappings/ethanhassett.com" -> (known after apply)
        name     = "ethanhassett.com"
      ~ status   = [
          - {
              - conditions          = [
                  - {
                      - message = "Waiting for certificate provisioning. You must configure your DNS records for certificate issuance to begin."
                      - reason  = "CertificatePending"
                      - status  = "Unknown"
                      - type    = "Ready"
                    },
                  - {
                      - message = "Certificate issuance pending."
                      - reason  = "CertificatePending"
                      - status  = "Unknown"
                      - type    = "CertificateProvisioned"
                    },
                  - {
                      - message = ""
                      - reason  = ""
                      - status  = "True"
                      - type    = "DomainRoutable"
                    },
                  - {
                      - message = "System will retry after 0:00:05 from lastTransitionTime for polling interval"
                      - reason  = "WaitingForOperation"
                      - status  = "True"
                      - type    = "Retry"
                    },
                ]
              - mapped_route_name   = "ethanhassett"
              - observed_generation = 1
              - resource_records    = [
                  - {
                      - name   = ""
                      - rrdata = "216.239.32.21"
                      - type   = "A"
                    },
                  - {
                      - name   = ""
                      - rrdata = "216.239.34.21"
                      - type   = "A"
                    },
                  - {
                      - name   = ""
                      - rrdata = "216.239.36.21"
                      - type   = "A"
                    },
                  - {
                      - name   = ""
                      - rrdata = "216.239.38.21"
                      - type   = "A"
                    },
                  - {
                      - name   = ""
                      - rrdata = "2001:4860:4802:32::15"
                      - type   = "AAAA"
                    },
                  - {
                      - name   = ""
                      - rrdata = "2001:4860:4802:34::15"
                      - type   = "AAAA"
                    },
                  - {
                      - name   = ""
                      - rrdata = "2001:4860:4802:36::15"
                      - type   = "AAAA"
                    },
                  - {
                      - name   = ""
                      - rrdata = "2001:4860:4802:38::15"
                      - type   = "AAAA"
                    },
                ]
            },
        ] -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ metadata {
          - annotations           = {} -> null
          ~ effective_annotations = {
              - "run.googleapis.com/operation-id"  = "4efe0a9c-8cf6-46b2-a09c-508ecc8072f3"
              - "serving.knative.dev/creator"      = "ethan@hassett.io"
              - "serving.knative.dev/lastModifier" = "ethan@hassett.io"
            } -> (known after apply)
          ~ effective_labels      = {
              - "cloud.googleapis.com/location" = "us-east1" -> null
              + "goog-terraform-provisioned"    = "true"
              + "repo"                          = "ethanhassett"
              - "run.googleapis.com/overrideAt" = "2024-10-06T20:29:45.373Z" -> null
            }
          ~ generation            = 1 -> 0
          - labels                = {} -> null
          ~ resource_version      = "AAYj1MuwFZc" -> (known after apply)
          ~ self_link             = "/apis/domains.cloudrun.com/v1/namespaces/1016775760988/domainmappings/ethanhassett.com" -> (known after apply)
          ~ terraform_labels      = {
              ~ "goog-terraform-provisioned" = "" -> "true"
              ~ "repo"                       = "" -> "ethanhassett"
            }
          ~ uid                   = "fefda88f-81a0-4b5f-9837-ccfb1768180c" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

      ~ spec {
          - force_override   = false -> null
            # (2 unchanged attributes hidden)
        }
    }

  # google_cloud_run_domain_mapping.www must be replaced
  # (imported from "locations/us-east1/namespaces/ethanhassett/domainmappings/www.ethanhassett.com")
  # Warning: this will destroy the imported resource
-/+ resource "google_cloud_run_domain_mapping" "www" {
      ~ id       = "locations/us-east1/namespaces/ethanhassett/domainmappings/www.ethanhassett.com" -> (known after apply)
        location = "us-east1"
        name     = "www.ethanhassett.com"
        project  = "ethanhassett"
      ~ status   = [
          - {
              - conditions          = [
                  - {
                      - message = "Waiting for certificate provisioning. You must configure your DNS records for certificate issuance to begin."
                      - reason  = "CertificatePending"
                      - status  = "Unknown"
                      - type    = "Ready"
                    },
                  - {
                      - message = "Certificate issuance pending."
                      - reason  = "CertificatePending"
                      - status  = "Unknown"
                      - type    = "CertificateProvisioned"
                    },
                  - {
                      - message = ""
                      - reason  = ""
                      - status  = "True"
                      - type    = "DomainRoutable"
                    },
                  - {
                      - message = "System will retry after 0:00:05 from lastTransitionTime for polling interval"
                      - reason  = "WaitingForOperation"
                      - status  = "True"
                      - type    = "Retry"
                    },
                ]
              - mapped_route_name   = "ethanhassett"
              - observed_generation = 1
              - resource_records    = [
                  - {
                      - name   = "www"
                      - rrdata = "ghs.googlehosted.com."
                      - type   = "CNAME"
                    },
                ]
            },
        ] -> (known after apply)

      ~ metadata {
          - annotations           = {} -> null
          ~ effective_annotations = {
              - "run.googleapis.com/operation-id"  = "d52e52c3-1dc1-4a33-ad0f-cbb55ea2162a"
              - "serving.knative.dev/creator"      = "ethan@hassett.io"
              - "serving.knative.dev/lastModifier" = "ethan@hassett.io"
            } -> (known after apply)
          ~ effective_labels      = { # forces replacement
              - "cloud.googleapis.com/location" = "us-east1" -> null
              + "goog-terraform-provisioned"    = "true"
              + "repo"                          = "ethanhassett"
              - "run.googleapis.com/overrideAt" = "2024-10-06T20:30:53.655Z" -> null
            }
          ~ generation            = 1 -> 0
          - labels                = {} -> null
            namespace             = "ethanhassett"
          ~ resource_version      = "AAYj1M+VUaU" -> (known after apply)
          ~ self_link             = "/apis/domains.cloudrun.com/v1/namespaces/1016775760988/domainmappings/www.ethanhassett.com" -> (known after apply)
          ~ terraform_labels      = { # forces replacement
              + "goog-terraform-provisioned" = "true"
              + "repo"                       = "ethanhassett"
            }
          ~ uid                   = "4774d7e9-8e0d-4fa1-849c-6218bb0d1e4f" -> (known after apply)
        }

      ~ spec {
            certificate_mode = "AUTOMATIC"
          - force_override   = false -> null
            route_name       = "ethanhassett"
        }
    }

Plan: 1 to import, 3 to add, 0 to change, 10 to destroy.
╷
│ Error: Invalid for_each argument
│ 
│   on main.tf line 111, in resource "cloudflare_record" "this":
│  111:   for_each = local.dns_records
│     ├────────────────
│     │ local.dns_records will be known only after apply
│ 
│ The "for_each" map includes keys derived from resource attributes that
│ cannot be determined until apply, and so OpenTofu cannot determine the full
│ set of keys that will identify the instances of this resource.
│ 
│ When working with unknown values in for_each, it's better to define the map
│ keys statically in your configuration and place apply-time results only in
│ the map values.
│ 
│ Alternatively, you could use the -target planning option to first apply
│ only the resources that the for_each value depends on, and then apply a
│ second time to fully converge.
╵
[01J9C189FNGT0S8ZE53S3QGFF6] Unexpected exit code when planning changes: 1
```

</details>